Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/consumers_and_the_law_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Your rights as a consumer in Ireland
ga: Cearta Tomhaltóirí in Éirinn

source: The following information is an overview of consumer law in Ireland
ga: Is achoimre í an méid seo a leanas ar dhlí na dtomhaltóirí in Éirinn

source: It sets out basic rules when you buy goods and services
ga: Leagann sí amach na bunrialacha nuair a cheannaíonn tú earraí agus seirbhísí

source: There are also links to more detailed information explaining your rights in specific situations
ga: Tá naisc ann freisin chuig eolas níos mionsonraithe a mhíníonn do chearta i gcúinsí faoi leith

source: In Ireland, the rights of consumers of goods and services are protected by Irish and EU laws
ga: Is iad dlíthe na hÉireann agus an AE a thugann cosaint do chearta thomhaltóirí earraí agus seirbhísí in Éirinn

source: Consumer law aims to ensure that consumers have enough information about prices and quality of products and services to make suitable choices on what to buy
ga: Bíonn an aidhm ag dlí na dtomhaltóirí freisin chun a chinntiú go mbíonn earraí sábháilte agus déanta chuig caighdeán inghlactha

source: Consumer law also aims to ensure that goods are safe and are manufactured to an acceptable standard
ga: Míníonn an méid a leanas céard is tomhaltóir agus céard is conradh ann

source: Consumer law only takes effect in certain situations and depends on what the contract is between the consumer and the provider of the items or services in question
ga: Ní théann dlí na dtomhaltóirí i bhfeidhm ach i gcúinsí áirithe agus braitheann sé ar an gcineál conartha a bhíonn idir an tomhaltóir agus soláthraí na míreanna nó na seirbhísí i gceist

source: The following explains who is a consumer and what is a contract
ga: Míníonn an méid seo a leanas an té is tomhaltóir ann agus an ní is conradh ann

source: Who is a consumer?
ga: Céard is tomhaltóir ann?

source: Generally speaking a consumer is defined in Irish law as a natural person who buys goods or a service for personal use or consumption from someone whose business it is to sell goods or provide services
ga: Sainmhínítear an tomhaltóir go ginearálta i ndlí na hÉireann mar dhuine nádúrtha a cheannaíonn earraí nó seirbhís lena leas go pearsanta nó lena dtomhailt ó dhuine éigin arb é a ngnó é earraí a dhíol nó seirbhísí a sholáthar

source: By law, you are not a consumer if you:
ga: De réir an dlí, ní tomhaltóir tú

source: • Receive goods as a gift
ga: • Má fhaigheann tú earraí i bhfoirm bronntanais

source: • Buy goods for commercial purposes (i.e
ga: • Má cheannaíonn tú earraí ar mhaithe le cúiseanna tráchtála (.i

source: you will be using the goods for commercial and not private use)
ga: beidh tú ag úsáid na n-earraí ar bhonn tráchtála agus gan ar bhonn príobháideach)

source: • Buy goods for private use that are normally used for business purposes
ga: • Má cheannaíonn tú earraí do do leas príobháideach féin a úsáidtear in earnáil an ghnó de ghnáth

source: • Buy goods from an individual who is not in business (i.e
ga: • Má cheannaíonn tú earraí ó dhuine aonair nach bhfuil i mbun gnó (.i

source: you buy a car from an individual whose normal business is not selling cars)
ga: ceannaíonn tú carr ó dhuine aonair nach é a ngnáthghnó é cairr a dhíol)

source: What is a contract?
ga: Céard is conradh ann?

source: A contract is a formal agreement between two or more people that is enforceable by law
ga: Is comhaontú foirmiúil idir beirt nó níos mó daoine é conradh ar infheidhmithe faoin dlí é

source: When you buy goods or services you enter into a contract with the seller
ga: Iontrálann tú i gconradh leis an díoltóir nuair a cheannaíonn tú earraí nó seirbhísí

source: Contracts are made up of terms; some of which can be implied terms
ga: Is téarmaí atá i mbunús na gconarthaí, ar féidir le roinnt acu a bheith ina dtéarmaí intuigthe

source: Contracts may be written or oral
ga: Féadann conarthaí a bheith i bhfoirm scríofa nó i bhfoirm béil

source: It is easier to know what the terms are in a written contract but an oral contract is also enforceable in law
ga: Is fusa a bheith feasach faoi théarmaí conartha scríofa ach is infheidhmithe sa dlí freisin é an conradh béil

source: Contracts may differ in many ways and there are no hard and fast rules governing what terms should be in a consumer contract
ga: Féadann go leor éagsúlachtaí a bheith idir conarthaí agus ní bhíonn aon rialacha dochta daingne ann a rialaíonn na téarmaí ar ceart a bheith i gconradh tomhaltóireachta

source: Terms in consumer contracts must always be fair and clear to the consumer
ga: Ní foláir do théarmaí i gconarthaí tomhaltóirí a bheith cothrom agus soiléir don tomhaltóir i gcónaí

source: The following general rules apply to consumer contracts
ga: Feidhmíonn na rialacha ginearálta seo a leanas do chonarthaí tomhaltóirí

source: Consumer contracts are protected by the Sale of Goods and Supply of Services Act, 1980
ga: Is é an tAcht um Dhíol Earraí agus Soláthar Seirbhísí, 1980 a thugann cosaint do chonarthaí tomhaltóirí

source: Under this Act the purchaser of goods has a number of rights - the main ones are
ga: Faoin Acht seo bíonn roinnt ceart ag ceannaitheoir earraí - is iad seo na príomhchinn

source: • Goods must be of merchantable quality – goods should be of reasonable quality taking into account what they are meant to do, their durability and their price
ga: • Ní foláir go mbeadh na hearraí de cháilíocht indíolta – caighdeán réasúnach a bheith ag earraí ag cur a bhfeidhmeanna, a marthanacht agus a luach san áireamh

source: • Goods must be fit for their purpose – they must do what they are reasonably expected to do
ga: • Ní mór go mb’inniúil dá gcuspóir iad na hearraí – caitheann siad feidhmiú mar a mbítear ag dúil go réasúnta uathu

source: • Goods must be as described - the buyer must not be mislead into buying something by the description of goods or services given orally by a salesperson or an advertisement
ga: • Ní foláir go mbeadh na hearraí díreach mar a thuairiscítear iad – níor cheart go gcuirfí míchomhairle ar an gceannaitheoir chun ní éigin a cheannach trí thuairisc na n-earraí ná na seirbhísí a thugtar ar an mbéal beo ag díoltóir nó i bhfógra

source: When you buy goods in a sale you have the same rights as when you pay full price for the goods
ga: Nuair a cheannaíonn tú earraí i ndíolachán bíonn na cearta céanna agat agus nuair a íocann tú an lánphraghas as na hearraí

source: If you have a contract with a supplier of services you can expect that:
ga: Má bhíonn conradh agat le soláthraí seirbhísí, féadfaidh tú a bheith ag dúil le:

source: • The supplier has the necessary skill to provide the service
ga: • go mbíonn dóthain oilteachta ag an soláthraí chun an tseirbhís a sholáthar

source: • The service will be provided with proper care and diligence
ga: • go soláthrófaí an tseirbhís le cúram agus le díograis chuí

source: You can read more about your rights when you buy a service here
ga: • Ní foláir go mbeadh na hearraí a úsáidtear de cháilíocht indíolta

source: If you have a problem with an item that you have bought it is always the seller who should put things right
ga: Má thiteann rudaí sa bhfraoch, is é an díoltóir i gcónaí ar cheart cúrsaí a dheasú

source: As a general rule, the seller can either repair or replace the item
ga: Mar riail ghinearálta, féadann an díoltóir an mhír a dheisiú nó a ionadú

source: Alternatively, they can refund the costs of the item or service to the consumer
ga: Féadann siad costais na míre nó na seirbhíse don tomhaltóir a aisíoc mar mhalairt pholasaí

source: If you are not satisfied with the quality of goods or services you can:
ga: Mura mbíonn tú sásta le caighdeán na n-earraí ná na seirbhísí is féidir leat

source: • Return the goods to the supplier who sold it to you (you should not return the goods to the manufacturer)
ga: • Na hearraí a chur ar ais chuig an soláthraí a dhíol leat iad (níor chóir duit na hearraí a sheoladh ar ais chuig an déantúsóir)

source: • Act as soon as you can – a delay can indicate that you have accepted faulty goods or services
ga: • Glac gníomh chomh luath agus is féidir leat – féadann moill a chur in iúl gur ghlac tú le hearraí nó le seirbhísí lochtacha

source: • Do not attempt to repair the item yourself or give it to anyone else to repair it
ga: • Ná déan iarracht an mhír a dheisiú tú féin ná ná tabhair do dhuine ar bith eile í lena deisiú

source: • Make sure that you have a proof of purchase (a receipt, cheque stub, credit card statement or invoice)
ga: • Déan cinnte de go mbíonn cruthúnas ceannaigh agat (admháil, comhdhuille seice, ráiteas chárta creidmheasa nó sonrasc)

source: You have no grounds for redress if
ga: Ní bhíonn aon fhorais sásaimh agat más rud é

source: • You were told about the defect before you bought the item (for example, if the goods were marked 'shopsoiled')
ga: • Gur scrúdaigh tú an mhír sular cheannaigh tú í agus gur cheart go dtabharfá an locht faoi deara

source: • You examined the item before you bought it and should have seen the defect
ga: • Gur cheannaigh tú an mhír agus a fhios agat nárbh inniúil í don fheidhm a bhí ceaptha agat di

source: • You bought the item knowing that it wasn’t fit for what you wanted it to do
ga: • Gur bhris tú nó go ndearna tú dochar don táirge

source: • You broke or damaged the product
ga: • Go ndearna tú dearmad i gceannach na míre (m.sh

source: • You made a mistake when buying the item (for example, if you bought an item of clothing thinking it was black when it is actually navy)
ga: má cheannaigh tú mír éadaigh agus tú ag smaoineamh gur dhubh a dath agus í a bheith dúghorm go hiarbhír)

source: • You change your mind
ga: • Go n-athraíonn tú d’intinnse

source: Retailers are not obliged to give refunds or credit notes under the above circumstances even if you show proof of purchase
ga: Ní bhíonn iallach ar mhiondíoltóirí aisíocaíochtaí ná nótaí sochair a thabhairt sna cúinsí thuas fiú má thaispeánann tú cruthúnas ceannaigh

source: It is important to note that there are no hard and fast rules as to which remedy you should be entitled to
ga: Tá sé tábhachtach go dtabharfaí faoi deara nach mbíonn aon rialacha dochta daingne ann faoin réiteach áirithe ar chóir duit a bheith i dteideal dó

source: When seeking redress for problems with goods or services the circumstances of each individual case must be taken into account
ga: Nuair a bhítear ag lorg sásaimh d’fhadhbanna le hearraí nó le seirbhísí, ní mór cúinsí gach cás ar leith a thabhairt san áireamh

source: Further information on your rights when goods are faulty is available on consumerhelp.ie
ga: Tá tuilleadh eolais faoi do chearta nuair a beidh earraí lochtacha ar fáil ar consumerhelp.ie

source: If you are not satisfied with the seller's response you may be able to take a claim to the Small Claims Court
ga: Mura bhfuil tú sásta le freagairt an díoltóra le freagairt an díoltóra‚ d’fhéadfá bheith i dteideal éileamh a thabhairt a fhad leis an gCúirt Mionéileamh

source: If you made your purchase using your debit or credit card you may be able to get your bank or credit card company to reverse the transaction
ga: Má rinne tú do cheannach agus leas á bhaint as do chárta dochair nó creidmheasa‚ d’fhéadfá bheith in ann iarraidh ar do bhanc nó do chuideachta chárta creidmheasa an idirbheartaíocht a aisiompú

source: This is called a chargeback
ga: Tugtar aisghearradh air seo

source: You should contact your card provider as soon as possible
ga: Ba cheart duit dul i dteagmháil le do sholáthraí cárta a luaithe is féidir

source: Give them details of the transaction you are disputing and request that they follow it up
ga: Tabhair dóibh sonraí na hidirbheartaíochta atá ina ábhar díospóide agus iarr orthu í a fhiosrú

source: Most card schemes offer full chargeback rights to consumers, but with some debit cards schemes you cannot use the chargeback facility if you did not receive the goods
ga: Cuireann tromlach na scéimeanna cárta aisghearradh iomlán ar fáil do thomhaltóirí, ach i roinnt scéimeanna cártaí dochair, ní féidir leat áis an aisghearrtha a úsáid mura bhfuair tú na hearraí

source: Further information on chargeback is available on the Competition and Consumer Protection Commission's website
ga: Tá breis faisnéise ar fáil aisghearradh ar láithreán gréasáin na Gníomhaireachta Náisiúnta do Thomhaltóirí

source: Competition and Consumer Protection Commission
ga: An Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: The Competition and Consumer Protection Commission (CCPC) is the statutory office with responsibility for providing advice and information to consumers on their rights
ga: Is iad an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí (CCPC) an oifig reachtúil ar a bhfuil an fhreagracht as an gcomhairle agus an fhaisnéis a chur ar fáil do thomhaltóirí ar a gcuid ceart

source: In addition, the CCPC is responsible for the enforcement of a wide range of consumer protection laws
ga: Sa mhullach air sin, tá an CCPC freagrach as réimse leathan de dhlíthe um chosaint tomhaltóirí a fhorfheidhmiú

source: The CCPC does not intervene or become involved in individual issues or disputes between consumers and sellers of goods or services providers
ga: Ní dhéanann an CCPC idirghábháil agus ní bhíonn siad páirteach i saincheisteanna nó disputes aonair idir tomhaltóirí agus díoltóirí earraí nó soláthraithe seirbhísí

source: The CCPC can, however, advise you if you have a particular consumer problem
ga: Féadfaidh an CCPC, áfach, comhairle a chur ort má bhíonn fadhb ar leith thomhaltóra agat

source: A deposit is a payment made to a supplier of a product or a service by a consumer which indicates an intention to buy a product or a service
ga: Is íocaíocht í éarlais a dhéantar chuig soláthraí táirge nó seirbhíse ag tomhaltóir a thugann mian le fios chun táirge a cheannach

source: The amount of the deposit and the timing of payment of the balance are a matter between the consumer and the supplier
ga: Is ábhar idir an tomhaltóir agus an soláthraí é méid na héarlaise agus uainiú íocaíocht an fhuílligh

source: When you pay a deposit for goods a contract is created between you as a consumer, and the supplier of the product or service
ga: Cruthaítear conradh idir tusa mar thomhaltóir agus an soláthraí mar sholáthraí an táirge nó na seirhbíse nuair a íocann tú éarlais d’earraí

source: You should be clear at the time of paying a deposit what your obligations are (e.g
ga: Ba chóir go mba shoiléir duit ag tráth íoctha na héarlaise faoi d’iallach ann (m.sh

source: when you need to pay the balance, how much each payment is etc)
ga: cathain a chaitheann tú an fuílleach a íoc, cé mhéad a bheidh i ngach aon íocaíocht srl.)

source: You should also be clear about the duties of the supplier (e.g
ga: Ba cheart go mba shoiléir duit freisin faoi dhualgais an tsoláthraí (m.sh

source: when the product will be available)
ga: cathain a bheidh an táirge ar fáil)

source: It is always easier to know what your rights and responsibilities are if you have details of the contract in writing, however, a verbal contract is also enforceable
ga: Is éasca i gcónaí fios do chearta agus d’fhreagrachtaí a bheith agat má bhíonn mionsonraí an chonartha i scríbhinn agat; bíonn conradh béil infheidhmithe freisin ámh

source: If the supplier does not adhere to the terms of the contract (e.g
ga: Mura gcloíonn an soláthraí le téarmaí an chonartha (m.sh

source: delivery of a product takes significantly longer than stated) you may have a right to ask for your deposit to be returned
ga: seachadadh tárige ag glacadh i bhfad níos faide ná mar a maíodh) b'fhéidir go mbeadh ceart agat chun d'éarlais a fháil ar ais

source: If you pay a deposit to a supplier who, in return, holds an article for you and you change your mind about paying the balance the supplier may not in all these circumstances be obliged to return your deposit
ga: Má íocann tú éarlais chuig soláthraí a choinníonn seilbh ar earra mar chúiteamh duit agus go n-athraíonn tú d'intinn faoi íoc an fhuílligh, d’fhéadfadh sé nach mbeadh ar an soláthraí i ngach aon cheann de na himthosca seo d’éarlais a thabhairt ar ais chugat

source: If the seller goes out of business before goods are delivered
ga: Má éagann gnó an díoltóra sula seachadtar earraí

source: If you buy goods (or pay a deposit on them) and the seller goes out of business before they are delivered, you may have considerable difficulty in getting either the goods or your money back
ga: Má cheannaíonn tú earraí (nó má íocann tú éarlais astu) agus go n-éagann gnó an díoltóra sula seachadtar iad; b’fhéidir go mbeadh deacrachtaí móra agat chun na hearraí nó d’airgead a fháil ar ais

source: Usually the seller in these circumstances owes money to a number of people so your claim is just one of many
ga: Is gnách go mbíonn an díoltóir sna cúinsí seo i bhfiacha do roinnt daoine, agus gur ceann amháin as go leor é d’éileamhsa

source: There are rules for the priority to be given to the various debts in the case of the business going into liquidation or receivership
ga: Tá rialacha ann don tosaíocht le tabhairt chuig fiacha éagsúla sa chás go dtéann an ghnólacht faoi leachtú nó faoi ghlacadóireacht

source: Generally, the individual customer is low in the order of priority
ga: Bíonn an custaiméir aonair go híseal san ord tosaíochta de ghnáth

source: If you paid for the goods by credit card, it is worthwhile to contact the credit card company who may not have actually paid or may be able to cancel the payment – you do not have a right to have this done but the credit card company may be able to do it for you. Information on how to protect yourself from sellers who may go out of business and on your rights if a business is liquidated is available on the Competition and Consumer Protection Commission's website
ga: Má íoc tú as na hearraí le cárta creidmheasa, is fiú go mór dul i dteagmháil le comhlacht an chárta chreidmheasa óir gur dóichí nár íoc siad an íocaíocht nó gur féidir leo í a chealú - ní bhíonn ceart agat chun é sin a dhéanamh ach féadann an comhlacht chárta creidmheasa é sin a dhéanamh ar do shonsa

source: Information on Goods, Services and Prices
ga: Eolas faoi Earraí, Seirbhísí agus Praghsanna

source: Consumers are entitled to information which protects them from false claims about goods, services and prices under the Consumer Protection Act 2007
ga: Bíonn tomhaltóirí i dteideal d’fhaisnéis a thugann cosaint dóibh ó éilimh bhréagacha faoi earraí, seirbhísí agus praghsanna faoin an tAcht um Chosaint Tomhaltóirí 2007

source: Under the act it is an offence for any retailer or professional to make a false or misleading claim about goods, services and prices
ga: Faoin acht seo is cion é d’aon miondíoltóir nó gairmí éileamh bréagach nó míthreorach a dhéanamh faoi earraí, seirbhísí agus praghsanna

source: It is also an offence to sell goods which bear a false or misleading description
ga: Is cion é freisin chun earraí a dhíol ar a mbíonn tuairisc bhréagach nó mhíthreorach

source: Claims about the weight, ingredients and performance of goods must be stated truthfully
ga: Ní mór éilimh faoi mheáchan, bunábhair agus feidhmiú earraí a mhaíomh go fírinneach

source: Also claims made about how items operate and where they were made must be true
ga: Ní foláir d’eilimh a dhéantar faoin gcaoi ina n-oibríonn míreanna agus faoin áit a ndearnadh iad a bheith fíor

source: Claims about the time, place or manner in which a service is provided and claims about the effect of a service and the service providers must also be true
ga: Caitheann éilimh faoin am, áit nó faoin gcaoi ina soláthraítear seirbhís agus éilimh faoi éifeacht seirbhísí agus na soláthraithe seirbhíse a bheith fíor freisin

source: This act also covers claims about prices
ga: Clúdaíonn an t-acht seo éilimh faoi phraghsanna

source: Actual prices, previous prices and recommended prices of goods and services must be stated truthfully
ga: Ní foláir praghsanna iarbhír, praghsanna roimhe agus praghsanna molta d'earraí agus seirbhísí a shloinneadh go fírinneach

source: Where a price is stated it should be clear what particular item it relates to
ga: Sa chás go maítear praghas, ba cheart go mba shoiléir céard í an mhír lena mbaineann sé

source: It should be the total price and there should be no hidden extras
ga: Ba chóir gurb é an praghas iomlán é agus níor cheart aon bhreisithe folaithe a bheith leis

source: If a retailer makes a mistake the buyer does not have the right to demand that the goods be sold to them at the marked price
ga: Má dhéanann miondíoltóir meancóg, ní bhíonn an ceart ag an gceannaitheoir chun a éileamh go ndíoltar na hearraí leo ag an bpraghas marcáilte
